In [10]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\arai\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\arai\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\arai\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\arai\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\arai\appdata\local\packages\pythonsoftwarefoundation.python.3.13_qbz5n2kfra8p0\localcache\local-packages\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [11]:
import pandas as pd

In [18]:
data = {
    "Name": ["Mansur", "Ramazan", "Arailym", "Daniya", "Pankgea"],
    "Age": [19, 22, 21, 20, 23],
    "Score": [85, 78, 92, 88, 75]
}

In [13]:
df = pd.DataFrame(data)
df

      Name  Age  Score
0   Mansur   19     85
1  Ramazan   22     78
2  Arailym   21     92
3   Daniya   20     88
4  Pankgea   23     75

In [14]:
df.head(3)

      Name  Age  Score
0   Mansur   19     85
1  Ramazan   22     78
2  Arailym   21     92

In [19]:
df.describe()

             Age      Score
count   5.000000   5.000000
mean   21.000000  83.600000
std     1.581139   7.021396
min    19.000000  75.000000
25%    20.000000  78.000000
50%    21.000000  85.000000
75%    22.000000  88.000000
max    23.000000  92.000000

In [20]:
df["Score"].mean()

np.float64(83.6)

In [21]:
df[df["Age"] > 20]

      Name  Age  Score
1  Ramazan   22     78
2  Arailym   21     92
4  Pankgea   23     75

In [22]:
df[df["Score"] > 80]

      Name  Age  Score
0   Mansur   19     85
2  Arailym   21     92
3   Daniya   20     88